Repository: jacobjiangwei/Private-AI-on-your-device
Catalog: PrivateAI/PrivateAI/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ already attached
zh_hans: %@ 已添加

source: %lld compacted · %lld omitted
zh_hans: 已压缩 %1$lld 条 · 已省略 %2$lld 条

source: %lld installed models
zh_hans: 已安装 %lld 个模型

source: %lld pages · %@
zh_hans: %1$lld 页 · %2$@

source: %lld sections · native text
zh_hans: %lld 个段落 · 本地文本

source: 1 installed model
zh_hans: 已安装 1 个模型

source: A chat can include up to %lld documents.
zh_hans: 一个对话最多可包含 %lld 个文档。

source: A location request is already in progress.
zh_hans: 已有位置请求正在进行。

source: Action blocked
zh_hans: 操作已阻止

source: Add %@ to chat
zh_hans: 将 %@ 添加到对话

source: Add an Ollama model
zh_hans: 添加 Ollama 模型

source: Add to chat
zh_hans: 添加到对话

source: Added from Library
zh_hans: 已从资料库添加

source: Adding locally
zh_hans: 正在本地添加

source: Already attached
zh_hans: 已添加

source: Apple Maps local search failed: %@
zh_hans: Apple 地图附近搜索失败：%@

source: Attach a local file
zh_hans: 添加本地文件

source: Attach file
zh_hans: 添加文件

source: Attachment failed
zh_hans: 附件处理失败

source: Attachment unavailable
zh_hans: 附件不可用

source: Blocked unsafe URL: %@
zh_hans: 已阻止不安全的 URL：%@

source: Branched from %@
zh_hans: 分支自 %@

source: Browser tool unavailable: %@
zh_hans: 浏览器工具不可用：%@

source: Calculating locally
zh_hans: 正在本地计算

source: Cancel
zh_hans: 取消

source: Chat %@
zh_hans: 对话 %@

source: Chat %@, %@
zh_hans: 对话 %1$@，%2$@

source: Chat save failed
zh_hans: 对话保存失败

source: Chat title
zh_hans: 对话标题

source: Chats, memories, logs, imported file copies, extracted text, and local model profiles stay in PrivateAI's sandbox container. Deleting a chat does not delete its Library documents.
zh_hans: 对话、记忆、日志、导入的文件副本、提取文本和本地模型摘要都保存在 PrivateAI 的沙盒容器中。删除对话不会删除资料库中的文档。

source: Checking
zh_hans: 正在检查

source: Checking local Ollama
zh_hans: 正在检查本地 Ollama

source: Checking this Mac
zh_hans: 正在检查这台 Mac

source: Choose File
zh_hans: 选择文件

source: Choose the local file to grant read access
zh_hans: 选择本地文件以授予读取权限

source: Connecting to Ollama…
zh_hans: 正在连接 Ollama…

source: Contacting Ollama on this Mac.
zh_hans: 正在连接这台 Mac 上的 Ollama。

source: Context
zh_hans: 上下文

source: Copy Pull Command
zh_hans: 复制拉取命令

source: Core chat and document analysis are sent only to the Ollama service on this Mac. PrivateAI has no account, advertising, analytics, or cloud-model fallback.
zh_hans: 核心对话和文档分析仅发送给这台 Mac 上的 Ollama 服务。PrivateAI 不需要账户、不含广告或分析追踪，也不会回退到云端模型。

source: Could not open the local document library: %@
zh_hans: 无法打开本地文档资料库：%@

source: Could not prepare the document library: %@
zh_hans: 无法准备文档资料库：%@

source: Could not update the document library: %@
zh_hans: 无法更新文档资料库：%@

source: Create local Qwen profile
zh_hans: 创建本地 Qwen 摘要

source: Create Qwen profile for %@
zh_hans: 为 %@ 创建 Qwen 摘要

source: Data stored on this Mac
zh_hans: 保存在这台 Mac 上的数据

source: Delete
zh_hans: 删除

source: Delete %@ from Library
zh_hans: 从资料库删除 %@

source: Delete chat
zh_hans: 删除对话

source: Delete chat %@
zh_hans: 删除对话 %@

source: Delete from Library
zh_hans: 从资料库删除

source: Delete from Library?
zh_hans: 从资料库删除？

source: Deleted from Library
zh_hans: 已从资料库删除

source: Deleted from Library; chat history update failed
zh_hans: 已从资料库删除，但对话历史更新失败

source: Document already attached
zh_hans: 文档已添加

source: Document Library
zh_hans: 文档资料库

source: Documents appear after you attach them to a chat.
zh_hans: 将文档添加到对话后，它们会显示在这里。

source: Done
zh_hans: 完成

source: Editing creates a new chat
zh_hans: 编辑会创建新对话

source: Editing from %@. Sending creates a new chat; the original stays unchanged.
zh_hans: 正在编辑 %@ 中的消息。发送后会创建新对话，原对话保持不变。

source: Encrypted PDFs are not supported.
zh_hans: 不支持加密的 PDF。

source: Enter to send • Shift+Enter for a newline
zh_hans: 按 Return 发送 • 按 Shift+Return 换行

source: Evidence required
zh_hans: 需要可靠依据

source: External retrieval was blocked because the user did not ask to send attachment-derived information to the web.
zh_hans: 已阻止外部检索，因为用户没有要求将附件中的信息发送到网络。

source: Fast
zh_hans: 快速

source: Fast mode sends think:false.
zh_hans: 快速模式会发送 think:false。

source: File access was not granted
zh_hans: 未授予文件访问权限

source: File access was not granted.
zh_hans: 未授予文件访问权限。

source: Generating…
zh_hans: 正在生成…

source: Grant access with macOS
zh_hans: 通过 macOS 授予访问权限

# HTTP %lld from %@.
source: HTTP %1$lld from %2$@.
zh_hans: %2$@ 返回 HTTP %1$lld。

source: Inference
zh_hans: 推理

source: Information unavailable
zh_hans: 信息不可用

source: Install any Ollama model, then recheck. A recommended model command is shown above the conversation.
zh_hans: 安装任意 Ollama 模型后重新检查。对话上方提供了推荐模型命令。

source: Install any Ollama model. The recommended Qwen command below downloads about %@; available disk: %@.
zh_hans: 安装任意 Ollama 模型。下方推荐的 Qwen 命令将下载约 %1$@；可用磁盘空间：%2$@。

source: Install Ollama from its official download page. Recovery actions are available above the conversation.
zh_hans: 请从 Ollama 官方下载页面安装。恢复操作位于对话上方。

source: Install Ollama from the official site
zh_hans: 从官方网站安装 Ollama

source: Installed version %@; PrivateAI requires %@ or newer.
zh_hans: 已安装版本 %1$@；PrivateAI 需要 %2$@ 或更高版本。

source: Installed version: %@. Update Ollama to continue using local models.
zh_hans: 已安装版本：%@。更新 Ollama 后才能继续使用本地模型。

source: Invalid URL: %@
zh_hans: 无效的 URL：%@

source: Library
zh_hans: 资料库

source: Library unavailable
zh_hans: 资料库不可用

source: Local by design
zh_hans: 本地优先设计

source: Local calculation
zh_hans: 本地计算

source: Local data unavailable
zh_hans: 本地数据不可用

source: Local Memories
zh_hans: 本地记忆

source: Local model is ready
zh_hans: 本地模型已就绪

source: Local model profile queued
zh_hans: 本地模型摘要已加入队列

source: Local model ready
zh_hans: 本地模型已就绪

source: Local model status
zh_hans: 本地模型状态

source: Local Ollama
zh_hans: 本地 Ollama

source: Location access is restricted by macOS policy or parental controls.
zh_hans: 位置访问受到 macOS 策略或家长控制的限制。

source: Location access was blocked because the request did not authorize current location use.
zh_hans: 已阻止位置访问，因为该请求未授权使用当前位置。

source: Location is unavailable: %@
zh_hans: 位置信息不可用：%@

source: Location permission was denied. Enable it in macOS Privacy & Security settings.
zh_hans: 位置权限已被拒绝。请在 macOS 的‘隐私与安全性’设置中启用。

source: Location services are disabled on this Mac.
zh_hans: 这台 Mac 已关闭定位服务。

source: Mac context
zh_hans: Mac 上下文

source: Memories
zh_hans: 记忆

source: Memory
zh_hans: 记忆

source: Message
zh_hans: 消息

source: Model
zh_hans: 模型

source: Model Page
zh_hans: 模型页面

source: Model status
zh_hans: 模型状态

source: Nearby search
zh_hans: 附近搜索

source: Network request failed: %@
zh_hans: 网络请求失败：%@

source: New chat
zh_hans: 新建对话

source: New Chat
zh_hans: 新建对话

source: No documents
zh_hans: 没有文档

source: No extractable text
zh_hans: 没有可提取的文本

source: No local models installed
zh_hans: 未安装本地模型

source: No local Ollama models are installed.
zh_hans: 尚未安装本地 Ollama 模型。

source: No matches
zh_hans: 没有匹配项

source: No matching chats
zh_hans: 没有匹配的对话

source: No memories
zh_hans: 没有记忆

source: No model
zh_hans: 无模型

source: None selected
zh_hans: 未选择

source: Official Download
zh_hans: 官方下载

source: Official Update
zh_hans: 官方更新

source: Older turns were reduced to stay within the local model context window.
zh_hans: 较早的对话已精简，以适应本地模型的上下文窗口。

source: Ollama %@ is serving %@ locally.
zh_hans: Ollama %1$@ 正在本地运行 %2$@。

source: Ollama %@ is using %@. Inference runs locally on this Mac.
zh_hans: Ollama %1$@ 正在使用 %2$@。推理在这台 Mac 上本地运行。

source: Ollama connected
zh_hans: Ollama 已连接

source: Ollama did not report a model digest, so PrivateAI could not create a reproducible document profile.
zh_hans: Ollama 未提供模型摘要，因此 PrivateAI 无法创建可复现的文档摘要。

source: Ollama is installed but its local service is not reachable. Open it, then return here.
zh_hans: Ollama 已安装，但无法连接其本地服务。打开 Ollama 后返回此处。

source: Ollama is not installed
zh_hans: 未安装 Ollama

source: Ollama is not running
zh_hans: Ollama 未运行

source: Ollama needs an update
zh_hans: Ollama 需要更新

source: Ollama receives think:true. Thinking appears only when the model streams real thinking text.
zh_hans: Ollama 将收到 think:true。仅当模型实际流式输出思考文本时才会显示思考过程。

source: Ollama requires macOS 14 or newer. PrivateAI opens ollama.com and never installs software for you.
zh_hans: Ollama 需要 macOS 14 或更高版本。PrivateAI 只会打开 ollama.com，不会替你安装软件。

source: Ollama returned an invalid response.
zh_hans: Ollama 返回了无效响应。

source: Ollama stream error: %@
zh_hans: Ollama 流式响应错误：%@

source: Ollama update required
zh_hans: 需要更新 Ollama

source: Open Data Folder
zh_hans: 打开数据文件夹

source: Open Logs
zh_hans: 打开日志

source: Open Ollama
zh_hans: 打开 Ollama

source: Open Online Privacy Policy
zh_hans: 打开在线隐私政策

source: Open the Ollama app, then recheck. Recovery actions are available above the conversation.
zh_hans: 打开 Ollama 应用后重新检查。恢复操作位于对话上方。

source: Opening Library
zh_hans: 正在打开资料库

source: Opening local data
zh_hans: 正在打开本地数据

source: Output
zh_hans: 输出

source: Preparing local documents…
zh_hans: 正在准备本地文档…

source: Privacy & Data
zh_hans: 隐私与数据

source: Private conversations on this Mac
zh_hans: 在这台 Mac 上进行私密对话

source: PrivateAI cannot open a path typed in chat. Choose %@ to grant read access.
zh_hans: PrivateAI 无法直接打开对话中输入的路径。请选择 %@ 以授予读取权限。

source: PrivateAI could not safely open its on-device data. Nothing was reset and no cloud fallback was used.
zh_hans: PrivateAI 无法安全打开设备上的数据。未重置任何内容，也未使用云端备用方案。

source: PrivateAI is checking the loopback service and installed models.
zh_hans: PrivateAI 正在检查本机回环服务和已安装模型。

source: PrivateAI keeps chats, memories, and documents on this Mac.
zh_hans: PrivateAI 将对话、记忆和文档保存在这台 Mac 上。

source: PrivateAI supports PDF, static images, text, common source-code files, RTF, HTML, Word, and OpenDocument attachments.
zh_hans: PrivateAI 支持 PDF、静态图像、文本、常见源代码文件、RTF、HTML、Word 和 OpenDocument 附件。

source: Prompt
zh_hans: 提示词

source: Public IP lookup failed: %@
zh_hans: 公网 IP 查询失败：%@

source: Pull command copied
zh_hans: 拉取命令已复制

source: Qwen profile
zh_hans: Qwen 摘要

source: Qwen returned an invalid document profile.
zh_hans: Qwen 返回了无效的文档摘要。

source: Read webpage
zh_hans: 读取网页

source: Reading a webpage
zh_hans: 正在读取网页

source: Ready
zh_hans: 就绪

source: Recheck
zh_hans: 重新检查

source: Remove %@
zh_hans: 移除 %@

source: Remove attachment
zh_hans: 移除附件

source: Rename
zh_hans: 重命名

source: Rename chat
zh_hans: 重命名对话

source: Request failed
zh_hans: 请求失败

source: Request too large
zh_hans: 请求过大

source: Retry
zh_hans: 重试

source: Search chats
zh_hans: 搜索对话

source: Search files and contents
zh_hans: 搜索文件和内容

source: Searching nearby places
zh_hans: 正在搜索附近地点

source: Searching the web
zh_hans: 正在搜索网页

source: Send
zh_hans: 发送

source: Send in new chat
zh_hans: 在新对话中发送

source: SESSIONS
zh_hans: 对话

source: Settings
zh_hans: 设置

source: Short durable summaries generated locally after chat becomes idle.
zh_hans: 对话空闲后会在本地生成简短、持久的摘要。

source: Speed
zh_hans: 速度

source: Start Ollama and select a local model to create a profile.
zh_hans: 启动 Ollama 并选择本地模型后才能创建摘要。

source: Start Ollama to continue
zh_hans: 启动 Ollama 以继续

source: Start the installed Ollama app
zh_hans: 启动已安装的 Ollama 应用

source: Stop
zh_hans: 停止

source: Stopped
zh_hans: 已停止

source: Stopping…
zh_hans: 正在停止…

source: The attachment exceeds the %@ limit.
zh_hans: 附件超过 %@ 的大小限制。

# The conversation grew to about %lld tokens, beyond the %lld-token input budget.
source: The conversation grew to about %1$lld tokens, beyond the %2$lld-token input budget.
zh_hans: 对话已增长到约 %1$lld 个 token，超过 %2$lld 个 token 的输入预算。

source: The current request needs about %1$lld tokens, but only %2$lld input tokens are available.
zh_hans: 当前请求需要约 %1$lld 个 token，但只有 %2$lld 个输入 token 可用。

source: The document data was deleted, but one or more historical chat references could not be saved.
zh_hans: 文档数据已删除，但一个或多个历史对话引用无法保存。

source: The document has no material that Qwen can analyze.
zh_hans: 文档中没有可供 Qwen 分析的内容。

source: The document library uses newer schema version %lld. Update PrivateAI before opening it.
zh_hans: 文档资料库使用了较新的架构版本 %lld。请更新 PrivateAI 后再打开。

source: The document was deleted, but PrivateAI is still finishing secure local cleanup. Close other PrivateAI windows and retry.
zh_hans: 文档已删除，但 PrivateAI 仍在完成安全的本地清理。请关闭其他 PrivateAI 窗口后重试。

source: The image could not be decoded.
zh_hans: 无法解码该图像。

source: The local attachment data is missing.
zh_hans: 本地附件数据缺失。

source: The local context action requires one or more supported fields.
zh_hans: 本地上下文操作需要一个或多个受支持的字段。

source: The local document library returned invalid data.
zh_hans: 本地文档资料库返回了无效数据。

source: The local model returned invalid arguments for %@.
zh_hans: 本地模型为 %@ 返回了无效参数。

source: The location request timed out.
zh_hans: 位置请求超时。

source: The Ollama response ended before it completed.
zh_hans: Ollama 响应在完成前意外结束。

source: The Ollama URL is invalid.
zh_hans: Ollama URL 无效。

source: The PDF could not be opened.
zh_hans: 无法打开该 PDF。

source: The request exceeded the local time limit.
zh_hans: 请求超过了本地时间限制。

source: The response exceeded the local size limit.
zh_hans: 响应超过了本地大小限制。

source: The server returned an invalid response.
zh_hans: 服务器返回了无效响应。

source: The stored document no longer matches the file that was originally imported.
zh_hans: 已保存的文档与最初导入的文件不再一致。

source: Thinking
zh_hans: 思考

source: Thinking mode
zh_hans: 思考模式

source: Thinking…
zh_hans: 正在思考…

source: This PDF has no usable embedded text. Scanned and complex PDFs are not supported in this version.
zh_hans: 此 PDF 没有可用的嵌入文本。本版本不支持扫描版和复杂版式 PDF。

source: This permanently removes %@, its extracted text, and local Qwen profiles. Past chats keep only the file reference.
zh_hans: 这将永久删除 %@、其提取文本和本地 Qwen 摘要。历史对话只保留文件引用。

source: This text file is not valid UTF-8.
zh_hans: 此文本文件不是有效的 UTF-8 编码。

# transcript.attachment
source: Attachment
zh_hans: 附件

# transcript.attachmentUnavailable
source: Attachment unavailable
zh_hans: 附件不可用

# transcript.complete
source: Complete
zh_hans: 完成

# transcript.copied
source: Copied
zh_hans: 已复制

# transcript.copy
source: Copy
zh_hans: 复制

# transcript.copyableText
source: Copyable text
zh_hans: 可复制文本

# transcript.copyResponse
source: Copy response
zh_hans: 复制回复

# transcript.details
source: Details
zh_hans: 详情

# transcript.edit
source: Edit
zh_hans: 编辑

# transcript.failed
source: Failed
zh_hans: 失败

# transcript.generating
source: Generating
zh_hans: 正在生成

# transcript.image
source: Image
zh_hans: 图像

# transcript.localCalculation
source: Local calculation
zh_hans: 本地计算

# transcript.localContext
source: Mac context
zh_hans: Mac 上下文

# transcript.nativeText
source: native text
zh_hans: 本地文本

# transcript.nearbySearch
source: Nearby search
zh_hans: 附近搜索

# transcript.noExtractableText
source: No extractable text
zh_hans: 没有可提取的文本

# transcript.noResponse
source: No response
zh_hans: 无回复

# transcript.pages
source: pages
zh_hans: 页

# transcript.privateConversation
source: Private conversations with your local Ollama models.
zh_hans: 使用本地 Ollama 模型进行私密对话。

# transcript.readWebpage
source: Read webpage
zh_hans: 读取网页

# transcript.regenerate
source: Regenerate
zh_hans: 重新生成

# transcript.retry
source: Retry
zh_hans: 重试

# transcript.running
source: Running
zh_hans: 运行中

# transcript.sections
source: sections
zh_hans: 个段落

# transcript.thinking
source: Thinking
zh_hans: 思考

# transcript.tool
source: Tool
zh_hans: 工具

# transcript.webSearch
source: Web search
zh_hans: 网页搜索

source: Try another filename or phrase.
zh_hans: 请尝试其他文件名或短语。

source: TTFT
zh_hans: 首字延迟

source: Unavailable
zh_hans: 不可用

source: unknown
zh_hans: 未知

source: Update Ollama
zh_hans: 更新 Ollama

source: Useful durable details will appear here.
zh_hans: 有用的持久信息会显示在这里。

source: Using %@
zh_hans: 正在使用 %@

source: Web search
zh_hans: 网页搜索

source: Web search failed: %@
zh_hans: 网页搜索失败：%@

source: When a task needs current information, PrivateAI may send a search query to DuckDuckGo or fetch a website you requested. Nearby searches use your location only after your request authorizes it. These actions are shown in the conversation.
zh_hans: 当任务需要最新信息时，PrivateAI 可能会向 DuckDuckGo 发送搜索查询，或读取你请求的网站。仅当你的请求授权后，附近搜索才会使用位置信息。这些操作会显示在对话中。

source: When PrivateAI uses the network
zh_hans: PrivateAI 何时使用网络

source: Yesterday
zh_hans: 昨天

source: You choose files through macOS. Delete chats from the sidebar, delete memories from Memories, and permanently remove stored document data from the Document Library.
zh_hans: 你通过 macOS 选择文件。可从侧边栏删除对话、从‘记忆’中删除记忆，并从文档资料库永久移除已保存的文档数据。

source: Your controls
zh_hans: 你的控制选项
